In [4]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import sqlite3

In [5]:
WORKING_DIRECTORY = 'D:/Fire Project/data/'

In [6]:
conn = sqlite3.Connection(WORKING_DIRECTORY + 'fire_data.db')

In [7]:
result = pd.read_sql("""
    SELECT COUNT(*) 
    FROM incident_address
""", conn)
result

   COUNT(*)
0  12571892

In [8]:
result2 = pd.read_sql("""
    SELECT * 
    FROM incident_address
    LIMIT 1
""", conn)
result2

,INTEGER,INCIDENT_KEY,STATE,FDID,INC_DATE,INC_NO,EXP_NO,LOC_TYPE,NUM_MILE,STREET_PRE,STREETNAME,STREETTYPE,STREETSUF,APT_NO,CITY,STATE_ID,ZIP5,ZIP4,X_STREET
0,None,AK_11100_01012020_20001_0,AK,11100,1012020,20001,0,1,101,None,SAVIKKO,RD,None,None,Juneau,AK,99801,None,MAYFLOWER ISLAND RD FRONT ST